alibaba/AliOS-Things/platform/mcu/r5f565ne/bsp/iodefine.h
typedef struct st_drw2d {
	union {
		union {
			unsigned long LONG;
			struct {
				unsigned long :8;
				unsigned long SPANSTR:1;
				unsigned long SPANABT:1;
				unsigned long UNIONCD:1;
				unsigned long UNIONAB:1;
				unsigned long UNION56:1;
				unsigned long UNION34:1;
				unsigned long UNION12:1;
				unsigned long BAND2EN:1;
				unsigned long BAND1EN:1;
				unsigned long LIM6TH:1;
				unsigned long LIM5TH:1;
				unsigned long LIM4TH:1;
				unsigned long LIM3TH:1;
				unsigned long LIM2TH:1;
				unsigned long LIM1TH:1;
				unsigned long QUAD3EN:1;
				unsigned long QUAD2EN:1;
				unsigned long QUAD1EN:1;
				unsigned long LIM6EN:1;
				unsigned long LIM5EN:1;
				unsigned long LIM4EN:1;
				unsigned long LIM3EN:1;
				unsigned long LIM2EN:1;
				unsigned long LIM1EN:1;
			} BIT;
		} CONTROL;
		union {
			unsigned long LONG;
			struct {
				unsigned long :26;
				unsigned long DLIR:1;
				unsigned long ENUIR:1;
				unsigned long DLSTACT:1;
				unsigned long CACHEDTY:1;
				unsigned long BSYWR:1;
				unsigned long BSYENUM:1;
			} BIT;
		} STATUS;
	};
	union {
		union {
			unsigned long LONG;
			struct {
				unsigned long RLEPIXW:2;
				unsigned long BDIA:1;
				unsigned long BSIA:1;
				unsigned long CLUTFORM:1;
				unsigned long COLKEYEN:1;
				unsigned long CLUTEN:1;
				unsigned long RLEEN:1;
				unsigned long WRALPHA:2;
				unsigned long WRFMT:2;
				unsigned long RDFMT:2;
				unsigned long TEXFILTY:1;
				unsigned long TEXFILTX:1;
				unsigned long TEXCLPY:1;
				unsigned long TEXCLPX:1;
				unsigned long BC2:1;
				unsigned long BDI:1;
				unsigned long BSI:1;
				unsigned long BDF:1;
				unsigned long BSF:1;
				unsigned long WRFMT2:1;
				unsigned long BDFA:1;
				unsigned long BSFA:1;
				unsigned long RDFMT2:2;
				unsigned long USEACB:1;
				unsigned long PTNSRCL5:1;
				unsigned long TEXENA:1;
				unsigned long PTNEN:1;
			} BIT;
		} CONTROL2;
		union {
			unsigned long LONG;
			struct {
				unsigned long :4;
				unsigned long ACBLD:1;
				unsigned long :1;
				unsigned long COLKEY:1;
				unsigned long TEXCLUT256:1;
				unsigned long RLEUNIT:1;
				unsigned long :1;
				unsigned long TEXCLUT:1;
				unsigned long PERFCNT:1;
				unsigned long TXCACHE:1;
				unsigned long FBCACHE:1;
				unsigned long DLR:1;
				unsigned long :5;
				unsigned long REV:12;
			} BIT;
		} HWVER;
	};
	char           wk0[8];
	unsigned long  L1START;
	unsigned long  L2START;
	unsigned long  L3START;
	unsigned long  L4START;
	unsigned long  L5START;
	unsigned long  L6START;
	unsigned long  L1XADD;
	unsigned long  L2XADD;
	unsigned long  L3XADD;
	unsigned long  L4XADD;
	unsigned long  L5XADD;
	unsigned long  L6XADD;
	unsigned long  L1YADD;
	unsigned long  L2YADD;
	unsigned long  L3YADD;
	unsigned long  L4YADD;
	unsigned long  L5YADD;
	unsigned long  L6YADD;
	unsigned long  L1BAND;
	unsigned long  L2BAND;
	char           wk1[4];
	union {
		unsigned long LONG;
		struct {
			unsigned long COL1A:8;
			unsigned long COL1R:8;
			unsigned long COL1G:8;
			unsigned long COL1B:8;
		} BIT;
	} COLOR1;
	union {
		unsigned long LONG;
		struct {
			unsigned long COL2A:8;
			unsigned long COL2R:8;
			unsigned long COL2G:8;
			unsigned long COL2B:8;
		} BIT;
	} COLOR2;
	char           wk2[8];
	unsigned long  PATTERN;
	union {
		unsigned long LONG;
		struct {
			unsigned long Y:16;
			unsigned long X:16;
		} BIT;
	} SIZE;
	union {
		unsigned long LONG;
		struct {
			unsigned long SSD:16;
			unsigned long PITCH:16;
		} BIT;
	} PITCH;
	unsigned long  ORIGIN;
	char           wk3[12];
	unsigned long  LUST;
	unsigned long  LUXADD;
	unsigned long  LUYADD;
	unsigned long  LVSTI;
	unsigned long  LVSTF;
	unsigned long  LVXADDI;
	unsigned long  LVYADDI;
	union {
		unsigned long LONG;
		struct {
			unsigned long LVYADDF:16;
			unsigned long LVXADDF:16;
		} BIT;
	} LVYXADDF;
	char           wk4[4];
	unsigned long  TEXPITCH;
	union {
		unsigned long LONG;
		struct {
			unsigned long TEXVMSK:21;
			unsigned long TEXUMSK:11;
		} BIT;
	} TEXMSK;
	unsigned long  TEXORG;
	union {
		unsigned long LONG;
		struct {
			unsigned long :28;
			unsigned long DLIRCLR:1;
			unsigned long ENUIRCLR:1;
			unsigned long DLIREN:1;
			unsigned long ENUIREN:1;
		} BIT;
	} IRQCTL;
	union {
		unsigned long LONG;
		struct {
			unsigned long :28;
			unsigned long CFLUTX:1;
			unsigned long CENTX:1;
			unsigned long CFLUFX:1;
			unsigned long CENFX:1;
		} BIT;
	} CACHECTL;
	unsigned long  DLISTST;
	unsigned long  PERFCNT1;
	unsigned long  PERFCNT2;
	union {
		unsigned long LONG;
		struct {
			unsigned long TRG2:16;
			unsigned long TRG1:16;
		} BIT;
	} PERFTRG;
	char           wk5[4];
	unsigned long  TEXCLADDR;
	unsigned long  TEXCLDATA;
	unsigned long  TEXCLOFST;
	union {
		unsigned long LONG;
		struct {
			unsigned long :8;
			unsigned long R:8;
			unsigned long G:8;
			unsigned long B:8;
		} BIT;
	} COLKEY;
} st_drw2d_t;

typedef struct st_dtc {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :3;
			unsigned char RRS:1;
			unsigned char :4;
		} BIT;
	} DTCCR;
	char           wk0[3];
	void          *DTCVBR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char SHORT:1;
		} BIT;
	} DTCADMOD;
	char           wk1[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char DTCST:1;
		} BIT;
	} DTCST;
	char           wk2[1];
	union {
		unsigned short WORD;
		struct {
			unsigned short ACT:1;
			unsigned short :7;
			unsigned short VECN:8;
		} BIT;
	} DTCSTS;
	void          *DTCIBR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char SQTFRL:1;
		} BIT;
	} DTCOR;
	char           wk3[1];
	union {
		unsigned short WORD;
		struct {
			unsigned short ESPSEL:1;
			unsigned short :7;
			unsigned short VECN:8;
		} BIT;
	} DTCSQE;
	unsigned long  DTCDISP;
} st_dtc_t;

